# Task 4.9_1


#### 1.- Import of Data & Libraries
#### 2.- Wrangle the data, e.g. rename columns with logical names and drop columns that don’t add anything to your analysis.
##### 2.1 Data Verification
#### 2.2 Renaming the Columns

#### 2.3 Fundamental Data Quality and Consistency Check
##### 2.3.1 Existing mixed data type:
##### 2.3.2 Missing Values
##### 2.3.3. Handling Missing values
##### 2.3.4 Checking possible duplicate
##### 2.3.5 Possible Data Type Inconsistancy
#### 3.- Merge Dataframes
#### 4.- Export Dataframe

## 1.- Import of Data & Libraries

In [33]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

path = r'C:\Users\cmfag\OneDrive\Desktop\Data Analyst Specialist\Achievement 4\4.3_orders_products'

df_customers = pd.read_csv(os.path.join(path, '02 Data','Original Data','customers.csv'), index_col = False)

df_ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'aggregated_ords_prods_merge.pkl'))

# PART 1

## 2.- Wrangle the data, e.g. rename columns with logical names and drop columns that don’t add anything to your analysis.

### 2.1 Data Verification

In [25]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [26]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

### 2.2 Renaming the Columns

In [44]:
df_customers.rename(columns={
    'First Name': 'first_name',
    'Surnam': 'last_name',
    'STATE': 'state',
    'GENDER': 'gender',
    'AGE': 'age',
    'fam_status': 'family_status',
    'n_dependants': 'num_dependents'
}, inplace=True)

# Verify the changes
df_customers.head()

,user_id,first_name,last_name,Gender,state,Age,date_joined,num_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [50]:
# Harmonizing column names
df_customers.columns = df_customers.columns.str.strip().str.lower()

In [48]:
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#### Comments: at this first stage i would leave all the columns of the df.

#### * Regarding task: verify typo in Part1 Point nr.: 4 = ename columns with illogical names *

## 2.3  Fundamental Data Quality and Consistency Check

### 2.3.1 Existing mixed data type:

In [58]:
for column in df_customers.columns:
    mixed_data = df_customers[column].apply(type).nunique() > 1
    if mixed_data:
        print(f"Column {column} has mixed data types.")

Column first_name has mixed data types.

### 2.3.2 Missing Values

In [65]:
#are there missing values in each column?
missing_values = df_customers.isnull().sum()
print(missing_values)

# What is the % of missing values?
missing_percentage = (df_customers.isnull().sum() / len(df_customers)) * 100
print(missing_percentage)

user_id               0
first_name        11259
last_name             0
gender                0
state                 0
age                   0
date_joined           0
num_dependents        0
family_status         0
income                0
dtype: int64
user_id           0.000000
first_name        5.459994
last_name         0.000000
gender            0.000000
state             0.000000
age               0.000000
date_joined       0.000000
num_dependents    0.000000
family_status     0.000000
income            0.000000
dtype: float64

### 2.3.3. Handling Missing values

In [73]:
# The first_name column has 11259 (5.46%) of missing values. 
# Replaced by with 'Unknown'

df_customers['first_name'] = df_customers['first_name'].fillna('Unknown')

# Replaced by with 'Unknown'

In [79]:
# is there anyother missing value?

missing_values_after_impute = df_customers.isnull().sum()
print(missing_values_after_impute)

user_id           0
first_name        0
last_name         0
gender            0
state             0
age               0
date_joined       0
num_dependents    0
family_status     0
income            0
dtype: int64

### 2.3.4 Checking possible duplicate

In [83]:
duplicate_rows = df_customers[df_customers.duplicated()]
print(duplicate_rows)

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, num_dependents, family_status, income]
Index: []

### 2.3.5 Possible Data Type Inconsistancy

In [88]:
print(df_customers.dtypes)
print(df_ords_prods_merge.dtypes)

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
num_dependents     int64
family_status     object
income             int64
dtype: object
order_id                     int64
user_id                      int64
eval_set                    object
order_number                 int64
order_dow                    int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
Unnamed: 0                 float64
product_name                object
aisle_id                   float64
department_id              float64
prices                     float64
merge_check               category
day_label                   object
busiest_day                 object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
Customer_frequency         float64
frequency_flag              object
dtype: object

## 3.- Merge Dataframes

In [93]:
df_combined = pd.merge(df_ords_prods_merge, df_customers, on='user_id', how='left')

In [97]:
#review of merged df

df_combined.shape

(32435059, 34)

In [99]:
# Verifiying duplicates in the combined df
duplicates_combined = df_combined.duplicated().sum()
print(f'Number of duplicate rows in combined DataFrame: {duplicates_combined}')

Number of duplicate rows in combined DataFrame: 0

In [106]:
# Check for missing values in the combined df
missing_values_combined = df_combined.isnull().sum()
print("Missing values in combined DataFrame:")

Missing values in combined DataFrame:

In [102]:
# Missing values in combined DataFrame:

In [103]:
df_ords_prods_merge = df_ords_prods_merge.drop(columns=['Unnamed: 0'])

In [107]:
print(missing_values_combined)

order_id                        0
user_id                         0
eval_set                        0
order_number                    0
order_dow                       0
order_hour_of_day               0
days_since_prior_order    2078102
product_id                      0
add_to_cart_order               0
reordered                       0
Unnamed: 0                  30200
product_name                30200
aisle_id                    30200
department_id               30200
prices                      30200
merge_check                     0
day_label                       0
busiest_day                     0
busiest_period_of_day           0
max_order                       0
loyalty_flag                    0
average_spend                   0
spender_flag                    0
Customer_frequency              0
frequency_flag                  0
first_name                      0
last_name                       0
gender                          0
state                           0
age                             0
date_joined                     0
num_dependents                  0
family_status                   0
income                          0
dtype: int64

## 4.- Export Dataframe

In [112]:
df_combined.to_pickle(os.path.join(path, '02 Data','Prepared Data','Data_combined_13_11.pkl'))